DROP TABLE IF EXISTS Class;
CREATE TABLE IF NOT EXISTS Class (       -- 班级
    class_id        INTEGER PRIMARY KEY, -- 班级编号
    class_name      TEXT,                -- 班级名称
    college_id      INTEGER,             -- 学院编号
    teacher_id INTEGER,             -- 班主任编号
    FOREIGN KEY (college_id) REFERENCES College(college_id),FOREIGN KEY (teacher_id) REFERENCES Teacher(teacher_id)
);
DROP INDEX IF EXISTS Class_Index;
CREATE UNIQUE INDEX IF NOT EXISTS Class_Index ON Class(class_id);
insert into Class
values (1,'计算机1班',1,1),
       (2,'计算机2班',1,2),
       (3,'计算机3班',1,3),
       (4,'计算机4班',1,4),
       (5,'计算机5班',1,5),
       (6,'计算机6班',1,6),
       (7,'计算机7班',1,7),
       (8,'计算机8班',1,8),
       (9,'计算机9班',1,9),
       (10,'计算机10班',1,10),
       (11,'计算机11班',1,11),
       (12,'计算机12班',1,12),
       (13,'计算机13班',1,13),
       (14,'计算机14班',1,14),
       (15,'计算机15班',1,15),
       (16,'计算机16班',1,16),
       (17,'计算机17班',1,17),
       (18,'计算机18班',1,18),
       (19,'计算机19班',1,19),
       (20,'计算机20班',1,20),
       (21,'软件学院1班',21,21),
       (22,'软件学院2班',21,22),
       (23,'软件学院3班',21,23),
       (24,'软件学院4班',21,24),
       (25,'软件学院5班',21,25),
       (26,'软件学院6班',21,26),
       (27,'软件学院7班',21,27),
       (28,'软件学院8班',21,28),
       (29,'软件学院9班',21,29),
       (30,'软件学院10班',21,30),
       (31,'软件学院11班',21,31),
       (32,'软件学院12班',21,32),
       (33,'软件学院13班',21,33),
       (34,'软件学院14班',21,34),
       (35,'软件学院15班',21,35),
       (36,'软件学院16班',21,36),
       (37,'软件学院17班',21,37),
       (38,'软件学院18班',21,38),
       (39,'软件学院19班',21,39),
       (40,'软件学院20班',21,40);